jest.unmock('fs-extra')
import path from 'path-extra'
import ManageResource from '../src/ManageResource'
import {
  getWordOccurrencesForQuote,
  getQuoteOmittedString
} from '../src/wordOccurrenceHelpers'

function getTestResult(bookId, chapter, verse, quote) {
  const originalBiblePath = path.join('__tests__', 'fixtures', 'resources', 'el-x-koine', 'bibles', 'ugnt', 'v0.5')
  const resourceApi = new ManageResource(originalBiblePath, bookId)
  const verseString = resourceApi.getVerseString(chapter, verse)
  const words = getWordOccurrencesForQuote(quote, verseString)

  return words;
}
/**
 * NOT WORKING

    {// MAT	28	7	sp2a	figs-quotesinquotes	εἴπατε τοῖς μαθηταῖς αὐτοῦ ... ἠγέρθη ἀπὸ τῶν νεκρῶν ... ἰδοὺ, προάγει ὑμᾶς εἰς τὴν Γαλιλαίαν; ἐκεῖ αὐτὸν ὄψεσθε
    // const quote = "εἴπατε τοῖς μαθηταῖς αὐτοῦ ... ἠγέρθη ἀπὸ τῶν νεκρῶν ... ἰδοὺ, προάγει ὑμᾶς εἰς τὴν Γαλιλαίαν; ἐκεῖ αὐτὸν ὄψεσθε"
    // const wholeQuote = "εἴπατε τοῖς μαθηταῖς αὐτοῦ, ὅτι ἠγέρθη ἀπὸ τῶν νεκρῶν; καὶ ἰδοὺ, προάγει ὑμᾶς εἰς τὴν Γαλιλαίαν; ἐκεῖ αὐτὸν ὄψεσθε"
    // const verseString = "καὶ ταχὺ πορευθεῖσαι, εἴπατε τοῖς μαθηταῖς αὐτοῦ, ὅτι ἠγέρθη ἀπὸ τῶν νεκρῶν; καὶ ἰδοὺ, προάγει ὑμᾶς εἰς τὴν Γαλιλαίαν; ἐκεῖ αὐτὸν ὄψεσθε. ἰδοὺ, εἶπον ὑμῖν.\""
    },
    {// COL	2	7	e2x6	figs-idiom	ἐρριζωμένοι ... ἐποικοδομούμενοι ... βεβαιούμενοι ... περισσεύοντες
      quote: "ἐρριζωμένοι ... ἐποικοδομούμενοι ... βεβαιούμενοι ... περισσεύοντες",
      wholeQuote: "ἐρριζωμένοι καὶ ἐποικοδομούμενοι ἐν αὐτῷ, καὶ βεβαιούμενοι τῇ πίστει, καθὼς ἐδιδάχθητε, περισσεύοντες",
      verseString: "ἐρριζωμένοι καὶ ἐποικοδομούμενοι ἐν αὐτῷ, καὶ βεβαιούμενοι τῇ πίστει, καθὼς ἐδιδάχθητε, περισσεύοντες ἐν εὐχαριστίᾳ.",
    },
    {// COL	1	9	f2xd	figs-exclusive	ἡμεῖς ... ἠκούσαμεν ... καὶ αἰτούμενοι
      quote: "ἡμεῖς ... ἠκούσαμεν ... καὶ αἰτούμενοι",
      wholeQuote: "ἡμεῖς, ἀφ’ ἧς ἡμέρας ἠκούσαμεν, οὐ παυόμεθα ὑπὲρ ὑμῶν προσευχόμενοι καὶ αἰτούμενοι",
      verseString: "διὰ τοῦτο καὶ ἡμεῖς, ἀφ’ ἧς ἡμέρας ἠκούσαμεν, οὐ παυόμεθα ὑπὲρ ὑμῶν προσευχόμενοι καὶ αἰτούμενοι, ἵνα πληρωθῆτε τὴν ἐπίγνωσιν τοῦ θελήματος αὐτοῦ ἐν πάσῃ σοφίᾳ καὶ συνέσει πνευματικῇ,",
    },
    {// MAT 3:5 figs-metonymy
    // const quote = "τότε ... Ἱεροσόλυμα ... πᾶσα ἡ Ἰουδαία, καὶ πᾶσα ἡ περίχωρος"
    // const wholeQuote = "τότε ἐξεπορεύετο πρὸς αὐτὸν Ἱεροσόλυμα, καὶ πᾶσα ἡ Ἰουδαία, καὶ πᾶσα ἡ περίχωρος"
    // const verseString = "τότε ἐξεπορεύετο πρὸς αὐτὸν Ἱεροσόλυμα, καὶ πᾶσα ἡ Ἰουδαία, καὶ πᾶσα ἡ περίχωρος τοῦ Ἰορδάνου,"
    },
    {// MAT	3	13	zbj9	figs-activepassive	τὸν ... Ἰωάννην ... βαπτισθῆναι ὑπ’
    // MA 3:13 figs-activepassive
    // const quote = "τὸν ... Ἰωάννην ... βαπτισθῆναι ὑπ’"
    // const wholeQuote = "τὸν Ἰορδάνην πρὸς τὸν Ἰωάννην, τοῦ βαπτισθῆναι ὑπ’"
    // const verseString = "τότε παραγίνεται ὁ Ἰησοῦς ἀπὸ τῆς Γαλιλαίας ἐπὶ τὸν Ἰορδάνην πρὸς τὸν Ἰωάννην, τοῦ βαπτισθῆναι ὑπ’ αὐτοῦ."
    },
    {// REV	3	17	v1pj	figs-metaphor	σὺ εἶ ὁ ταλαίπωρος ... ἐλεεινὸς ... πτωχὸς ... τυφλὸς, καὶ γυμνός
      quote: "σὺ εἶ ὁ ταλαίπωρος ... ἐλεεινὸς ... πτωχὸς ... τυφλὸς, καὶ γυμνός",
      wholeQuote: "σὺ εἶ ὁ ταλαίπωρος, καὶ ἐλεεινὸς, καὶ πτωχὸς, καὶ τυφλὸς, καὶ γυμνός",
      verseString: "ὅτι λέγεις, ὅτι πλούσιός‘ εἰμι, καὶ πεπλούτηκα, καὶ οὐδὲν χρείαν ἔχω’, καὶ οὐκ οἶδας ὅτι σὺ εἶ ὁ ταλαίπωρος, καὶ ἐλεεινὸς, καὶ πτωχὸς, καὶ τυφλὸς, καὶ γυμνός.",
    },
    {// REV	9	15	b3d6	figs-parallelism	εἰς τὴν ὥραν ... ἡμέραν ... μῆνα, καὶ ἐνιαυτόν
      quote: "εἰς τὴν ὥραν ... ἡμέραν ... μῆνα, καὶ ἐνιαυτόν",
      wholeQuote: "εἰς τὴν ὥραν, καὶ ἡμέραν, καὶ μῆνα, καὶ ἐνιαυτόν",
      verseString: "καὶ ἐλύθησαν οἱ τέσσαρες ἄγγελοι, οἱ ἡτοιμασμένοι εἰς τὴν ὥραν, καὶ ἡμέραν, καὶ μῆνα, καὶ ἐνιαυτόν, ἵνα ἀποκτείνωσιν τὸ τρίτον τῶν ἀνθρώπων.",
    },
    {// REV	12	9	pk5u	figs-distinguish	δράκων ὁ ... ὄφις ὁ ἀρχαῖος ... καλούμενος, Διάβολος, καὶ ὁ Σατανᾶς, ὁ πλανῶν τὴν οἰκουμένην ὅλην; ἐβλήθη εἰς τὴν γῆν, καὶ οἱ ἄγγελοι αὐτοῦ μετ’ αὐτοῦ ἐβλήθησαν
      quote: "δράκων ὁ ... ὄφις ὁ ἀρχαῖος ... καλούμενος, Διάβολος, καὶ ὁ Σατανᾶς, ὁ πλανῶν τὴν οἰκουμένην ὅλην; ἐβλήθη εἰς τὴν γῆν, καὶ οἱ ἄγγελοι αὐτοῦ μετ’ αὐτοῦ ἐβλήθησαν",
      wholeQuote: "δράκων ὁ μέγας, ὁ ὄφις ὁ ἀρχαῖος, ὁ καλούμενος, Διάβολος, καὶ ὁ Σατανᾶς, ὁ πλανῶν τὴν οἰκουμένην ὅλην; ἐβλήθη εἰς τὴν γῆν, καὶ οἱ ἄγγελοι αὐτοῦ μετ’ αὐτοῦ ἐβλήθησαν",
      verseString: "καὶ ἐβλήθη ὁ δράκων ὁ μέγας, ὁ ὄφις ὁ ἀρχαῖος, ὁ καλούμενος, Διάβολος, καὶ ὁ Σατανᾶς, ὁ πλανῶν τὴν οἰκουμένην ὅλην; ἐβλήθη εἰς τὴν γῆν, καὶ οἱ ἄγγελοι αὐτοῦ μετ’ αὐτοῦ ἐβλήθησαν.",
    },

    Good example of guessing data  /  broken
    MAT	18	1	pp31	figs-metonymy	ἐν ... τῇ ... Βασιλεία τῶν Οὐρανῶν
    MAT	3:5 figs-metonymy	τότε ... Ἱεροσόλυμα ... πᾶσα ἡ Ἰουδαία, καὶ πᾶσα ἡ περίχωρος
    ROM	10	19	s3nz	figs-explicit	ἐπ’ ... ἔθνει ... ἀσυνέτῳ
    REV	2	18	zbx5	figs-simile	ὁ ... ἔχων τοὺς ὀφθαλμοὺς ... ὡς φλόγα πυρός
 */

describe('getQuoteOmittedString():', () => {
  test('', () => {
    const checks = [
      // {// mat 1:7 figs-ellipsis
      //   quote: 'Ῥοβοάμ, Ῥοβοὰμ ... ἐγέννησεν τὸν Ἀβιά, Ἀβιὰ ... ἐγέννησεν τὸν Ἀσάφ',
      //   wholeQuote: "Ῥοβοάμ, Ῥοβοὰμ δὲ ἐγέννησεν τὸν Ἀβιά, Ἀβιὰ δὲ ἐγέννησεν τὸν Ἀσάφ",
      //   verseString: "Σολομὼν δὲ ἐγέννησεν τὸν Ῥοβοάμ, Ῥοβοὰμ δὲ ἐγέννησεν τὸν Ἀβιά, Ἀβιὰ δὲ ἐγέννησεν τὸν Ἀσάφ,",
      // },
      // {// TIT 1:15 figs-metaphor
      //   quote: "τοῖς ... μεμιαμμένοις καὶ ἀπίστοις, οὐδὲν καθαρόν",
      //   wholeQuote: "τοῖς δὲ μεμιαμμένοις καὶ ἀπίστοις, οὐδὲν καθαρόν",
      //   verseString: "πάντα καθαρὰ τοῖς καθαροῖς; τοῖς δὲ μεμιαμμένοις καὶ ἀπίστοις, οὐδὲν καθαρόν; ἀλλὰ μεμίανται αὐτῶν καὶ ὁ νοῦς, καὶ ἡ συνείδησις.",
      // },
      // {// MAT 3:2 figs-metonymy
      //   quote: "ἤγγικεν ... ἡ ... τῶν Οὐρανῶν",
      //   wholeQuote: "ἤγγικεν γὰρ ἡ Βασιλεία τῶν Οὐρανῶν",
      //   verseString: "λέγων, \"μετανοεῖτε, ἤγγικεν γὰρ ἡ Βασιλεία τῶν Οὐρανῶν.\"",
      // },
      // {// MAT	12	19	hb2m	figs-metonymy	οὐδὲ ... ἀκούσει τις ... τὴν φωνὴν αὐτοῦ
      //   quote: "οὐδὲ ... ἀκούσει τις ... τὴν φωνὴν αὐτοῦ",
      //   wholeQuote: "οὐδὲ κραυγάσει, οὐδὲ ἀκούσει τις ἐν ταῖς πλατείαις τὴν φωνὴν αὐτοῦ",
      //   verseString: "οὐκ ἐρίσει, οὐδὲ κραυγάσει, οὐδὲ ἀκούσει τις ἐν ταῖς πλατείαις τὴν φωνὴν αὐτοῦ.",
      // },
      // {// MAT	10	17	a55q	writing-connectingwords	προσέχετε ... ἀπὸ ... ἀνθρώπων; παραδώσουσιν
      //   quote: "προσέχετε ... ἀπὸ ... ἀνθρώπων; παραδώσουσιν",
      //   wholeQuote: "προσέχετε δὲ ἀπὸ τῶν ἀνθρώπων; παραδώσουσιν",
      //   verseString: "προσέχετε δὲ ἀπὸ τῶν ἀνθρώπων; παραδώσουσιν γὰρ ὑμᾶς εἰς συνέδρια, καὶ ἐν ταῖς συναγωγαῖς αὐτῶν μαστιγώσουσιν ὑμᾶς;",
      // },
      // {// MAT	18	1	pp31	figs-metonymy	ἐν ... τῇ ... Βασιλεία τῶν Οὐρανῶν
      //   quote: "ἐν ... τῇ ... Βασιλεία τῶν Οὐρανῶν",
      //   wholeQuote: "ἐν ἐκείνῃ τῇ ὥρᾳ προσῆλθον οἱ μαθηταὶ τῷ Ἰησοῦ λέγοντες, \"τίς ἄρα μείζων ἐστὶν ἐν τῇ Βασιλεία τῶν Οὐρανῶν",
      //   verseString: "ἐν ἐκείνῃ τῇ ὥρᾳ προσῆλθον οἱ μαθηταὶ τῷ Ἰησοῦ λέγοντες, \"τίς ἄρα μείζων ἐστὶν ἐν τῇ Βασιλεία τῶν Οὐρανῶν?\"",
      // },
      // {// MAT	19	12	m1r9	figs-activepassive	εἰσὶν ... εὐνοῦχοι, οἵτινες ... εὐνουχίσθησαν ὑπὸ τῶν ἀνθρώπων
      //   quote: "εἰσὶν ... εὐνοῦχοι, οἵτινες ... εὐνουχίσθησαν ὑπὸ τῶν ἀνθρώπων",
      //   wholeQuote: "εἰσὶν γὰρ εὐνοῦχοι, οἵτινες ἐκ κοιλίας μητρὸς ἐγεννήθησαν οὕτως, καὶ εἰσὶν εὐνοῦχοι οἵτινες εὐνουχίσθησαν ὑπὸ τῶν ἀνθρώπων",
      //   verseString: "εἰσὶν γὰρ εὐνοῦχοι, οἵτινες ἐκ κοιλίας μητρὸς ἐγεννήθησαν οὕτως, καὶ εἰσὶν εὐνοῦχοι οἵτινες εὐνουχίσθησαν ὑπὸ τῶν ἀνθρώπων, καὶ εἰσὶν εὐνοῦχοι οἵτινες εὐνούχισαν ἑαυτοὺς διὰ τὴν Βασιλείαν τῶν Οὐρανῶν. ὁ δυνάμενος χωρεῖν, χωρείτω.\"",
      // },
      // {// MAT	21	9	g73z	figs-metonymy	ὡσαννὰ ... ἐν ... τοῖς ὑψίστοις
      //   quote: "ὡσαννὰ ... ἐν ... τοῖς ὑψίστοις",
      //   wholeQuote: "ὡσαννὰ τῷ Υἱῷ Δαυείδ! εὐλογημένος‘ ὁ ἐρχόμενος ἐν ὀνόματι Κυρίου!’ ὡσαννὰ ἐν τοῖς ὑψίστοις",
      //   verseString: "οἱ δὲ ὄχλοι οἱ προάγοντες αὐτὸν καὶ οἱ ἀκολουθοῦντες ἔκραζον λέγοντες, \"ὡσαννὰ τῷ Υἱῷ Δαυείδ! εὐλογημένος‘ ὁ ἐρχόμενος ἐν ὀνόματι Κυρίου!’ ὡσαννὰ ἐν τοῖς ὑψίστοις!\"",
      // },
      // {// MAT	5	29	et3n	figs-you	εἰ ... ὁ ὀφθαλμός σου ὁ δεξιὸς
      //   quote: "εἰ ... ὁ ὀφθαλμός σου ὁ δεξιὸς",
      //   wholeQuote: "εἰ δὲ ὁ ὀφθαλμός σου ὁ δεξιὸς",
      //   verseString: "εἰ δὲ ὁ ὀφθαλμός σου ὁ δεξιὸς σκανδαλίζει σε, ἔξελε αὐτὸν καὶ βάλε ἀπὸ σοῦ; συμφέρει γάρ σοι ἵνα ἀπόληται ἓν τῶν μελῶν σου, καὶ μὴ ὅλον τὸ σῶμά σου βληθῇ εἰς Γέενναν.",
      // },
      // {// MAT	2	13 figs-explicit ἕως ... εἴπω σοι
      //   quote: "ἕως ... εἴπω σοι",
      //   wholeQuote: "ἕως ἂν εἴπω σοι",
      //   verseString: "ἀναχωρησάντων δὲ αὐτῶν, ἰδοὺ, ἄγγελος Κυρίου φαίνεται κατ’ ὄναρ τῷ Ἰωσὴφ λέγων, \"ἐγερθεὶς, παράλαβε τὸ παιδίον καὶ τὴν μητέρα αὐτοῦ καὶ φεῦγε εἰς Αἴγυπτον, καὶ ἴσθι ἐκεῖ ἕως ἂν εἴπω σοι; μέλλει γὰρ Ἡρῴδης ζητεῖν τὸ παιδίον τοῦ ἀπολέσαι αὐτό.\"",
      // },
      // {// COL	1	28	va1x	figs-exclusive	ἡμεῖς καταγγέλλομεν, νουθετοῦντες ... διδάσκοντες ... παραστήσωμεν
      //   quote: "ἡμεῖς καταγγέλλομεν, νουθετοῦντες ... διδάσκοντες ... παραστήσωμεν",
      //   wholeQuote: "ἡμεῖς καταγγέλλομεν, νουθετοῦντες πάντα ἄνθρωπον καὶ διδάσκοντες πάντα ἄνθρωπον ἐν πάσῃ σοφίᾳ, ἵνα παραστήσωμεν",
      //   verseString: "ὃν ἡμεῖς καταγγέλλομεν, νουθετοῦντες πάντα ἄνθρωπον καὶ διδάσκοντες πάντα ἄνθρωπον ἐν πάσῃ σοφίᾳ, ἵνα παραστήσωμεν πάντα ἄνθρωπον τέλειον ἐν Χριστῷ.",
      // },
      // {// ROM	1	11	f3g1	figs-explicit	τι ... χάρισμα ... πνευματικὸν, εἰς τὸ στηριχθῆναι ὑμᾶς
      //   quote: "τι ... χάρισμα ... πνευματικὸν, εἰς τὸ στηριχθῆναι ὑμᾶς",
      //   wholeQuote: "τι μεταδῶ χάρισμα ὑμῖν πνευματικὸν, εἰς τὸ στηριχθῆναι ὑμᾶς",
      //   verseString: "ἐπιποθῶ γὰρ ἰδεῖν ὑμᾶς, ἵνα τι μεταδῶ χάρισμα ὑμῖν πνευματικὸν, εἰς τὸ στηριχθῆναι ὑμᾶς;",
      // },
      // {// ROM	1	17	h38h	figs-activepassive	δικαιοσύνη ... Θεοῦ ... ἀποκαλύπτεται, ἐκ πίστεως εἰς πίστιν
      //   quote: "δικαιοσύνη ... Θεοῦ ... ἀποκαλύπτεται, ἐκ πίστεως εἰς πίστιν",
      //   wholeQuote: "δικαιοσύνη γὰρ Θεοῦ ἐν αὐτῷ ἀποκαλύπτεται, ἐκ πίστεως εἰς πίστιν",
      //   verseString: "δικαιοσύνη γὰρ Θεοῦ ἐν αὐτῷ ἀποκαλύπτεται, ἐκ πίστεως εἰς πίστιν; καθὼς γέγραπται, \"ὁ δὲ δίκαιος ἐκ πίστεως ζήσεται.\"",
      // },
      // {// ROM	2	24	q13d	figs-activepassive	τὸ ... ὄνομα τοῦ Θεοῦ ... βλασφημεῖται ἐν τοῖς ἔθνεσιν
      //   quote: "τὸ ... ὄνομα τοῦ Θεοῦ ... βλασφημεῖται ἐν τοῖς ἔθνεσιν",
      //   wholeQuote: "τὸ γὰρ ὄνομα τοῦ Θεοῦ δι’ ὑμᾶς βλασφημεῖται ἐν τοῖς ἔθνεσιν",
      //   verseString: "\"τὸ γὰρ ὄνομα τοῦ Θεοῦ δι’ ὑμᾶς βλασφημεῖται ἐν τοῖς ἔθνεσιν\", καθὼς γέγραπται.",
      // },
      // {// ROM	4	12	s9jt	figs-idiom	τοῖς ... στοιχοῦσιν τοῖς ἴχνεσιν τῆς ... πίστεως, τοῦ πατρὸς ἡμῶν Ἀβραάμ
      //   quote: "τοῖς ... στοιχοῦσιν τοῖς ἴχνεσιν τῆς ... πίστεως, τοῦ πατρὸς ἡμῶν Ἀβραάμ",
      //   wholeQuote: "τοῖς οὐκ ἐκ περιτομῆς μόνον, ἀλλὰ καὶ τοῖς στοιχοῦσιν τοῖς ἴχνεσιν τῆς ἐν ἀκροβυστίᾳ πίστεως, τοῦ πατρὸς ἡμῶν Ἀβραάμ",
      //   verseString: "καὶ πατέρα περιτομῆς τοῖς οὐκ ἐκ περιτομῆς μόνον, ἀλλὰ καὶ τοῖς στοιχοῦσιν τοῖς ἴχνεσιν τῆς ἐν ἀκροβυστίᾳ πίστεως, τοῦ πατρὸς ἡμῶν Ἀβραάμ.",
      // },
      // {// ROM	7	2	l6d9	figs-metaphor	ἡ ... ὕπανδρος γυνὴ τῷ ... ἀνδρὶ δέδεται νόμῳ
      //   quote: "ἡ ... ὕπανδρος γυνὴ τῷ ... ἀνδρὶ δέδεται νόμῳ",
      //   wholeQuote: "ἡ γὰρ ὕπανδρος γυνὴ τῷ ζῶντι ἀνδρὶ δέδεται νόμῳ",
      //   verseString: " ἡ γὰρ ὕπανδρος γυνὴ τῷ ζῶντι ἀνδρὶ δέδεται νόμῳ; ἐὰν δὲ ἀποθάνῃ ὁ ἀνήρ, κατήργηται ἀπὸ τοῦ νόμου τοῦ ἀνδρός.",
      // },
      // {// ROM	8	19	d911	figs-personification	ἡ ... ἀποκαραδοκία τῆς κτίσεως, τὴν ... ἀπεκδέχεται
      //   quote: "ἡ ... ἀποκαραδοκία τῆς κτίσεως, τὴν ... ἀπεκδέχεται",
      //   wholeQuote: "ἡ γὰρ ἀποκαραδοκία τῆς κτίσεως, τὴν ἀποκάλυψιν τῶν υἱῶν τοῦ Θεοῦ ἀπεκδέχεται",
      //   verseString: "ἡ γὰρ ἀποκαραδοκία τῆς κτίσεως, τὴν ἀποκάλυψιν τῶν υἱῶν τοῦ Θεοῦ ἀπεκδέχεται.",
      // },
      // {// ROM	14	7	c9ls	figs-explicit	οὐδεὶς ... ἑαυτῷ ... ἀποθνῄσκει
      //   quote: "οὐδεὶς ... ἑαυτῷ ... ἀποθνῄσκει",
      //   wholeQuote: "οὐδεὶς γὰρ ἡμῶν ἑαυτῷ ζῇ, καὶ οὐδεὶς ἑαυτῷ ἀποθνῄσκει",
      //   verseString: "οὐδεὶς γὰρ ἡμῶν ἑαυτῷ ζῇ, καὶ οὐδεὶς ἑαυτῷ ἀποθνῄσκει.",
      // },
      // {// REV	2	18	zbx5	figs-simile	ὁ ... ἔχων τοὺς ὀφθαλμοὺς ... ὡς φλόγα πυρός
      //   quote: "ὁ ... ἔχων τοὺς ὀφθαλμοὺς ... ὡς φλόγα πυρός",
      //   wholeQuote: "ὁ Υἱὸς τοῦ Θεοῦ, ὁ ἔχων τοὺς ὀφθαλμοὺς αὐτοῦ ὡς φλόγα πυρός",
      //   verseString: "καὶ τῷ ἀγγέλῳ τῆς ἐν Θυατείροις ἐκκλησίας γράψον: τάδε‘ λέγει ὁ Υἱὸς τοῦ Θεοῦ, ὁ ἔχων τοὺς ὀφθαλμοὺς αὐτοῦ ὡς φλόγα πυρός, καὶ οἱ πόδες αὐτοῦ ὅμοιοι χαλκολιβάνῳ:",
      // },
      {// MAT	28	7	sp2a	figs-quotesinquotes	εἴπατε τοῖς μαθηταῖς αὐτοῦ ... ἠγέρθη ἀπὸ τῶν νεκρῶν ... ἰδοὺ, προάγει ὑμᾶς εἰς τὴν Γαλιλαίαν; ἐκεῖ αὐτὸν ὄψεσθε
        quote: "εἴπατε τοῖς μαθηταῖς αὐτοῦ ... ἠγέρθη ἀπὸ τῶν νεκρῶν",
        wholeQuote: "εἴπατε τοῖς μαθηταῖς αὐτοῦ, ὅτι ἠγέρθη ἀπὸ τῶν νεκρῶν",
        verseString: "καὶ ταχὺ πορευθεῖσαι, εἴπατε τοῖς μαθηταῖς αὐτοῦ, ὅτι ἠγέρθη ἀπὸ τῶν νεκρῶν; καὶ ἰδοὺ, προάγει ὑμᾶς εἰς τὴν Γαλιλαίαν; ἐκεῖ αὐτὸν ὄψεσθε. ἰδοὺ, εἶπον ὑμῖν.\""
      },
    ]

    checks.forEach(({ quote, verseString, wholeQuote}) => {
      expect(getQuoteOmittedString(quote, verseString)).toEqual(wholeQuote)
    })
  })
})

describe('getWordOccurrencesForQuote():', () => {
  // test('', () => {
  //   const quote = "οὔτε‘ ἐνκατελείφθη εἰς ᾍδην"
  //   const words = getTestResult('act', 2, 31, quote)
  //   const expected = [
  //     {
  //       word: "οὔτε",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "‘ ",// take a look at this
  //       occurrence: 1,
  //     },
  //     {
  //       word: "ἐνκατελείφθη",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "εἰς",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "ᾍδην",
  //       occurrence: 1,
  //     },
  //   ]

  //   expect(words).toEqual(expected)
  // })

  // test('should generate an array of objects for an original language quote with ellipses', () => {
  //   const checks = [
      // {
      //   bookId: 'tit',
      //   chapter: 1,
      //   verse: 15,
      //   quote: "τοῖς ... μεμιαμμένοις καὶ ἀπίστοις, οὐδὲν καθαρόν",// omitted δὲ
      //   expected: [
      //     {
      //       word: "τοῖς",
      //       occurrence: 2,
      //     },
      //     {
      //       word: "μεμιαμμένοις",
      //       occurrence: 1,
      //     },
      //     {
      //       word: "καὶ",
      //       occurrence: 1,
      //     },
      //     {
      //       word: "ἀπίστοις",
      //       occurrence: 1,
      //     },
      //     {
      //       word: ",",
      //       occurrence: 1,
      //     },
      //     {
      //       word: "οὐδὲν",
      //       occurrence: 1,
      //     },
      //     {
      //       word: "καθαρόν",
      //       occurrence: 1,
      //     },
      //   ]
      // },
      // {
      //   bookId: 'act',
      //   chapter: 1,
      //   verse: 2,
      //   quote: "ἄχρι ἧς ἡμέρας ... ἀνελήμφθη",// omitted: ἐντειλάμενος τοῖς ἀποστόλοις διὰ Πνεύματος Ἁγίου , οὓς ἐξελέξατο,
      //   expected: []
      // },
      // {
      //   bookId: 'act',
      //   chapter: 1,
      //   verse: 2,
      //   quote: "ἐντειλάμενος ... διὰ Πνεύματος Ἁγίου",// omitted "τοῖς ἀποστόλοις"
      //   expected: []
      // },
      // {
      //   bookId: 'act',
      //   chapter: 15,
      //   verse: 2,
      //   quote: "στάσεως καὶ ζητήσεως οὐκ ὀλίγης ... πρὸς αὐτοὺς",// omitted τῷ Παύλῳ καὶ τῷ Βαρναβᾷ
      //   expected: []
      // },
      // {
      //   bookId: 'act',
      //   chapter: 1,
      //   verse: 10,
      //   quote: "ἀτενίζοντες ... εἰς τὸν οὐρανὸν", // omitted ἦσαν
      //   expected: []
      // },
      // {
      //   bookId: 'act',
      //   chapter: 3,
      //   verse: 21,
      //   quote: "στόματος τῶν ἁγίων ... αὐτοῦ προφητῶν", // omitted: ἀπ’ αἰῶνος
      //   expected: []
      // },
      // {
      //   bookId: 'mat',
      //   chapter: 1,
      //   verse: 5,
      //   quote: "Σαλμὼν ... ἐγέννησεν τὸν Βόες ἐκ τῆς Ῥαχάβ", // omitted: δὲ
      //   expected: []
      // },
      // {
      //   bookId: 'mat',
      //   chapter: 1,
      //   verse: 12,
      //   quote: "τὸν Σαλαθιήλ, Σαλαθιὴλ ... ἐγέννησεν τὸν Ζοροβαβέλ", // omitted: δὲ
      //   expected: []
      // },
      // {
      //   bookId: 'mat',
      //   chapter: 1,
      //   verse: 18,
      //   quote: "πρὶν ... συνελθεῖν αὐτοὺς", // omitted: ἢ
      //   expected: []
      // },
      // {
      //   bookId: 'mat',
      //   chapter: 1,
      //   verse: 24,
      //   quote: "ὡς προσέταξεν ... ὁ ἄγγελος Κυρίου", // omitted: αὐτῷ
      //   expected: []
      // },
      // {
      //   bookId: 'mat',
      //   chapter: 2,
      //   verse: 13,
      //   quote: "ἕως ... εἴπω σοι", // omitted:ἂν
      //   expected: []
      // },
      // {
      //   bookId: 'rom',
      //   chapter: 1,
      //   verse: 18,
      //   quote: "τὴν ἀλήθειαν ... κατεχόντων", // omitted: ἐν ἀδικίᾳ
      //   expected: []
      // },
      // {
      //   bookId: 'rom',
      //   chapter: 1,
      //   verse: 27,
      //   quote: "καὶ ... ἄρσενες ἀφέντες τὴν φυσικὴν χρῆσιν τῆς θηλείας", // omitted: οἱ
      //   expected: []
      // },
  //   ]

  //   checks.forEach(({ bookId, chapter, verse, quote, expected}) => {
  //     const result = getTestResult(bookId, chapter, verse, quote)
  //     expect(result).toEqual(expected)
  //   })
  // })

  // test('should generate an array of objects for an original language quote', () => {
  //   const quote = "Κρῆτες ἀεὶ ψεῦσται"
  //   const result = getTestResult('tit', 1, 12, quote)
  //   const expected = [
  //     {
  //       word: "Κρῆτες",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "ἀεὶ",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "ψεῦσται",
  //       occurrence: 1,
  //     }
  //   ]

  //   expect(result).toEqual(expected)
  // })

  // test('', () => {
  //   const quote = "ἐν κακίᾳ καὶ φθόνῳ διάγοντες"
  //   const result = getTestResult('tit', 3, 3, quote)
  //   const expected = [
  //     {
  //       word: "ἐν",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "κακίᾳ",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "καὶ",
  //       occurrence: 3,
  //     },
  //     {
  //       word: "φθόνῳ",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "διάγοντες",
  //       occurrence: 1,
  //     },
  //   ]

  //   expect(result).toEqual(expected)
  // })

  // test('', () => {
  //   const quote = "ματαιολόγοι, καὶ φρεναπάται"
  //   const words = getTestResult('tit', 1, 10, quote)
  //   const expected = [
  //     {
  //       word: "ματαιολόγοι",
  //       occurrence: 1,
  //     },
  //     {
  //       word: ",",
  //       occurrence: 2,
  //     },
  //     {
  //       word: "καὶ",
  //       occurrence: 2,
  //     },
  //     {
  //       word: "φρεναπάται",
  //       occurrence: 1,
  //     },
  //   ]

  //   expect(words).toEqual(expected)
  // })


  // test('', () => {
  //   const quote = "Κλαύδιος Λυσίας, τῷ κρατίστῳ ἡγεμόνι Φήλικι, χαίρειν"
  //   const words = getTestResult('act', 23, 26, quote)
  //   const expected = [
  //     {
  //       word: "Κλαύδιος",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "Λυσίας",
  //       occurrence: 1,
  //     },
  //     {
  //       word: ",",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "τῷ",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "κρατίστῳ",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "ἡγεμόνι",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "Φήλικι",
  //       occurrence: 1,
  //     },
  //     {
  //       word: ",",
  //       occurrence: 2,
  //     },
  //     {
  //       word: "χαίρειν",
  //       occurrence: 1,
  //     },
  //   ]

  //   expect(words).toEqual(expected)
  // })

  // test('', () => {
  //   const quote = "τοῦ δοῦναι μετάνοιαν τῷ Ἰσραὴλ καὶ ἄφεσιν ἁμαρτιῶν"
  //   const words = getTestResult('act', 5, 31, quote)
  //   const expected = [
  //     {
  //       word: "τοῦ",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "δοῦναι",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "μετάνοιαν",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "τῷ",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "Ἰσραὴλ",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "καὶ",
  //       occurrence: 2,
  //     },
  //     {
  //       word: "ἄφεσιν",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "ἁμαρτιῶν",
  //       occurrence: 1,
  //     }
  //   ]

  //   expect(words).toEqual(expected)
  // })

  // test('', () => {
  //   const quote = "καὶ ἐτελεύτησεν καὶ ἐτάφη"
  //   const words = getTestResult('act', 2, 29, quote)
  //   const expected = [
  //     {
  //       word: "καὶ",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "ἐτελεύτησεν",
  //       occurrence: 1,
  //     },
  //     {
  //       word: "καὶ",
  //       occurrence: 2,
  //     },
  //     {
  //       word: "ἐτάφη",
  //       occurrence: 1,
  //     },
  //   ]

  //   expect(words).toEqual(expected)
  // })

  // test('', () => {
  //   const quote = "τίμιος παντὶ τῷ λαῷ"
  //   const result = getTestResult('act', 5, 34, quote)
  //   const expected = [
  //     {
  //       word: "τίμιος",
  //       occurrence: 1
  //     },
  //     {
  //       word: "παντὶ",
  //       occurrence: 1
  //     },
  //     {
  //       word: "τῷ",
  //       occurrence: 2
  //     },
  //     {
  //       word: "λαῷ",
  //       occurrence: 1
  //     }
  //   ]

  //   expect(result).toEqual(expected)
  // })

  // test('', () => {
  //   const quote = "πάντες ὅσοι ἐπείθοντο αὐτῷ διελύθησαν"
  //   const result = getTestResult('act', 5, 36, quote)
  //   const expected = [
  //     {
  //       word: "πάντες",
  //       occurrence: 1
  //     },
  //     {
  //       word: "ὅσοι",
  //       occurrence: 1
  //     },
  //     {
  //       word: "ἐπείθοντο",
  //       occurrence: 1
  //     },
  //     {
  //       word: "αὐτῷ",
  //       occurrence: 1
  //     },
  //     {
  //       word: "διελύθησαν",
  //       occurrence: 1
  //     }
  //   ]

  //   expect(result).toEqual(expected)
  // })

  // test('', () => {
  //   const quote = "ἐὰν μὴ οὗτοι μείνωσιν ἐν τῷ πλοίῳ, ὑμεῖς σωθῆναι οὐ δύνασθε"
  //   const result = getTestResult('act', 27, 31, quote)
  //   const expected = [
  //     {
  //       word: "ἐὰν",
  //       occurrence: 1
  //     },
  //     {
  //       word: "μὴ",
  //       occurrence: 1
  //     },
  //     {
  //       word: "οὗτοι",
  //       occurrence: 1
  //     },
  //     {
  //       word: "μείνωσιν",
  //       occurrence: 1
  //     },
  //     {
  //       word: "ἐν",
  //       occurrence: 1
  //     },
  //     {
  //       word: "τῷ",
  //       occurrence: 2
  //     },
  //     {
  //       word: "πλοίῳ",
  //       occurrence: 1
  //     },
  //     {
  //       word: ",",
  //       occurrence: 2
  //     },
  //     {
  //       word: "ὑμεῖς",
  //       occurrence: 1
  //     },
  //     {
  //       word: "σωθῆναι",
  //       occurrence: 1
  //     },
  //     {
  //       word: "οὐ",
  //       occurrence: 1
  //     },
  //     {
  //       word: "δύνασθε",
  //       occurrence: 1
  //     }
  //   ]

  //   expect(result).toEqual(expected)
  // })
})
